In [15]:
import  pandas as pd
import numpy as np

In [16]:
car = pd.read_csv('quikr_car.csv')

In [17]:
car.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [19]:
car.shape

(892, 6)

In [21]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [22]:
car.describe()

              name company  year          Price  kms_driven fuel_type
count          892     892   892            892         840       837
unique         525      48    61            274         258         3
top     Honda City  Maruti  2015  Ask For Price  35,000 kms    Petrol
freq            13     235   117             35          30       440

In [23]:
car['year'].unique()

array(['2007', '2006', '2018', '2014', '2015', '2012', '2013', '2016',
       '2010', '2017', '2008', '2011', '2019', '2009', '2005', '2000',
       '...', '150k', 'TOUR', '2003', 'r 15', '2004', 'Zest', '/-Rs',
       'sale', '1995', 'ara)', '2002', 'SELL', '2001', 'tion', 'odel',
       '2 bs', 'arry', 'Eon', 'o...', 'ture', 'emi', 'car', 'able', 'no.',
       'd...', 'SALE', 'digo', 'sell', 'd Ex', 'n...', 'e...', 'D...',
       ', Ac', 'go .', 'k...', 'o c4', 'zire', 'cent', 'Sumo', 'cab',
       't xe', 'EV2', 'r...', 'zest'], dtype=object)

# Year has many garbage data

- 1.we have to clean the year and remove garbage data
- 2.Converting year (object) into int 
- 3.Removing ask for price in column price
- 4.Price object to int
- 5.kms_driven has kms with int
- 6.kms_dirven as nan values
- 7.remove nan values from fuel
- 8.Keep first 3 words as name


# Cleaning

In [8]:
backup = car.copy()

In [9]:
car = car[car['year'].str.isnumeric()]
car

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel
...,...,...,...,...,...,...
886,Toyota Corolla Altis,Toyota,2009,"3,00,000","1,32,000 kms",Petrol
888,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
889,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel
890,Honda Amaze 1.2 E i VTEC,Honda,2014,"1,80,000",Petrol,NaN
891,Chevrolet Sail 1.2 LT ABS,Chevrolet,2014,"1,60,000",Petrol,NaN

In [11]:
car['year']=car['year'].astype(int)

In [13]:
car.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 842 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        842 non-null    object
 1   company     842 non-null    object
 2   year        842 non-null    int32
 3   Price       842 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: int32(1), object(5)
memory usage: 42.8+ KB

In [26]:
car=car[car['Price']!='Ask For Price']

In [12]:
car['Price']=car['Price'].str.replace(',','').astype(int)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [13]:
car[car['fuel_type'].isna()]

                          name    company  year   Price  kms_driven fuel_type
132             Toyota Corolla     Toyota  2009  275000  26,000 kms       NaN
890   Honda Amaze 1.2 E i VTEC      Honda  2014  180000      Petrol       NaN
891  Chevrolet Sail 1.2 LT ABS  Chevrolet  2014  160000      Petrol       NaN

In [14]:
car['kms_driven']=car['kms_driven'].str.split(' ').str.get(0).str.replace(',','')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
car = car[car['kms_driven'].str.isnumeric()]
car['kms_driven']=car['kms_driven'].astype(int)

In [16]:
car=car[~car['fuel_type'].isna()]

In [17]:
car['name'] = car['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [18]:
car=car.reset_index(drop = True)

In [19]:
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 28.8+ KB

In [20]:
car.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [21]:
car= car[car['Price']<6e6].reset_index(drop=True)

In [22]:
car

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
811          Tata Indica V2      Tata  2009  110000       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
813            Tata Zest XM      Tata  2018  260000       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[815 rows x 6 columns]

In [23]:
car.to_csv('Cleaned _data.csv')

#  Modeling

In [24]:
x = car.drop(columns='Price')

In [25]:
y = car['Price']

In [26]:
x

                       name   company  year  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006          40    Diesel
2         Hyundai Grand i10   Hyundai  2014       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014       36000    Diesel
4                 Ford Figo      Ford  2012       41000    Diesel
..                      ...       ...   ...         ...       ...
810      Maruti Suzuki Ritz    Maruti  2011       50000    Petrol
811          Tata Indica V2      Tata  2009       30000    Diesel
812    Toyota Corolla Altis    Toyota  2009      132000    Petrol
813            Tata Zest XM      Tata  2018       27000    Diesel
814      Mahindra Quanto C8  Mahindra  2013       40000    Diesel

[815 rows x 5 columns]

In [27]:
y

0       80000
1      425000
2      325000
3      575000
4      175000
        ...
810    270000
811    110000
812    300000
813    260000
814    390000
Name: Price, Length: 815, dtype: int32

In [28]:
from sklearn.model_selection import train_test_split

In [29]:
x_train,x_test,y_train,y_test = train_test_split(x,y,train_size = 0.7)

In [30]:
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import OneHotEncoder
from sklearn.metrics import r2_score
from sklearn.pipeline import make_pipeline
from sklearn.compose import make_column_transformer

In [31]:
ohe  = OneHotEncoder()

In [32]:
ohe.fit(x[['name','company','fuel_type']])

OneHotEncoder(categories='auto', drop=None, dtype=<class 'numpy.float64'>,
              handle_unknown='error', sparse=True)

In [33]:
colum_tran = make_column_transformer((OneHotEncoder(categories=ohe.categories_),['name','company','fuel_type']),remainder= 'passthrough')

In [34]:
lr = LinearRegression()

In [35]:
pipe= make_pipeline(colum_tran,lr)

In [36]:
pipe.fit(x_train,y_train)

Pipeline(memory=None,
         steps=[('columntransformer',
                 ColumnTransformer(n_jobs=None, remainder='passthrough',
                                   sparse_threshold=0.3,
                                   transformer_weights=None,
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories=[array(['Audi A3 Cabriolet', 'Audi A4 1.8', 'Audi A4 2.0', 'Audi A6 2.0',
       'Audi A8', 'Audi Q3 2.0', 'Audi Q5 2.0', 'Audi Q7', 'BMW 3 Series',
       'BMW 5 Series', 'BMW 7 Series', 'B...
       'Renault', 'Skoda', 'Tata', 'Toyota', 'Volkswagen', 'Volvo'],
      dtype=object),
                                                                            array(['Diesel', 'LPG', 'Petrol'], dtype=object)],
                                                                drop=None,
                                                                dtype=<class 'numpy.float64'>,
                                                                handle_unknown='error',
                                                                sparse=True),
                                                  ['name', 'company',
                                                   'fuel_type'])],
                                   verbose=False)),
                ('linearregression',
                 LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
                                  normalize=False))],
         verbose=False)

In [37]:
y_pred=pipe.predict(x_test)

In [38]:
y_pred

array([ 1.01603035e+05,  2.49426035e+05,  2.42508574e+05,  1.70333107e+05,
        1.48260898e+05,  1.48672723e+05,  4.73252226e+05,  1.05006995e+06,
        2.88133108e+05,  4.27129193e+04,  1.97460087e+05, -1.97063153e+03,
        2.94830624e+05,  1.70251016e+05,  5.51726260e+05,  2.33632986e+05,
        1.32680992e+05,  8.76148886e+04,  2.24344124e+05,  4.11494681e+05,
        5.35071986e+05,  3.84538648e+05,  2.66029903e+05,  4.14864102e+05,
        2.26332192e+05,  6.68395387e+04,  1.11337166e+05,  3.66060838e+05,
        2.11766968e+05,  2.84963290e+05,  3.53325957e+05,  4.39487925e+05,
        2.57155916e+05,  8.55572122e+04, -5.40215796e+03,  3.37015978e+05,
        1.32853433e+06,  3.18093183e+05,  1.34231269e+06,  1.80953175e+06,
        5.33895599e+05,  5.24977279e+05,  4.44129323e+05,  5.10198844e+05,
        1.38503884e+05,  5.34537861e+05,  2.64041423e+05,  3.03722920e+05,
        4.45219268e+05,  8.34431063e+05,  2.73988852e+05,  4.00689991e+04,
        2.92157104e+05,  7.86907644e+05,  5.98749784e+05,  2.30962359e+05,
       -7.81005257e+04,  2.20177127e+05,  2.55504981e+05,  1.08961467e+05,
        1.39070373e+06,  1.03862449e+05,  2.29865651e+05,  2.81699800e+05,
        1.47146207e+06,  5.00743911e+05,  5.00821826e+05,  7.77076386e+05,
        2.42508574e+05,  6.36676400e+05, -7.25600149e+04,  1.59521751e+05,
        9.16393713e+04,  1.35084556e+05,  2.44996262e+05,  2.44710260e+05,
        1.96720479e+05,  5.62980318e+05,  3.83590993e+05,  2.43320677e+04,
        7.23139414e+05,  1.87454674e+05,  9.09847471e+05,  4.13692367e+05,
        7.88698360e+04,  6.34378425e+05,  2.27244591e+05,  9.34446639e+04,
        9.06621190e+05,  4.69325677e+05,  3.69480009e+05, -1.20787240e+04,
        3.32240046e+05,  3.97371880e+04,  4.31261036e+05,  8.34431063e+05,
        3.16018263e+05,  5.97539692e+05,  3.38885416e+05,  8.65651811e+04,
        1.81341670e+05,  4.16215439e+05,  3.23105732e+05,  8.34431063e+05,
        2.34528723e+05,  5.79398711e+05,  5.40478379e+05,  3.41088881e+05,
        2.77775886e+05,  2.04345716e+05,  2.50419913e+05,  2.73988852e+05,
        1.86279056e+05,  5.48989070e+05,  4.16215439e+05,  2.66429711e+05,
        8.27953132e+05,  5.17481491e+05,  5.08565550e+05,  2.79623358e+05,
        9.13723087e+04,  1.81255685e+05,  3.96527972e+05,  3.75211506e+05,
        1.71928025e+05,  2.90394627e+05,  2.24898387e+05,  1.99489272e+05,
        2.54633322e+05,  3.03837001e+05,  3.15359886e+05,  2.74359215e+05,
        9.38225564e+05,  2.02489964e+05,  3.69984759e+05,  3.67592774e+05,
        2.31571049e+05,  2.09038359e+05,  2.61322470e+05,  9.87267032e+05,
        5.72879470e+05,  1.08576213e+05,  2.22182412e+05, -1.66235446e+03,
        3.76394768e+05,  2.98185449e+05,  1.15819455e+05,  3.20674148e+05,
        3.62936188e+05,  7.30209096e+05,  5.05040323e+05,  1.35644240e+05,
        2.66946182e+05,  3.72940843e+05,  4.87140476e+05,  1.90601560e+05,
        5.03681600e+05,  1.25006950e+06,  6.02188007e+05,  9.05758122e+04,
        2.65625615e+05,  5.35417856e+05,  2.28849384e+05,  1.61142814e+05,
        1.24207397e+05,  2.78296288e+05,  1.99954377e+04,  9.95407210e+05,
        4.88804211e+05,  3.36406005e+05,  7.07179830e+05,  1.54714623e+05,
        6.07147169e+04,  2.69514883e+05,  5.07764362e+05,  2.03711187e+05,
        6.45134741e+05,  7.28449260e+05,  2.34528723e+05,  7.01432090e+05,
        6.19671652e+05,  1.30951585e+05,  2.90928752e+05,  2.50419913e+05,
        2.95202898e+05,  2.48579063e+05,  2.66317032e+05,  4.98494282e+04,
        4.80565481e+05,  2.42508574e+05,  2.78642490e+05,  3.03252953e+05,
        3.72666228e+05,  4.53826401e+05,  2.19120471e+05,  5.49830729e+05,
        3.41021917e+05,  1.80796004e+05,  2.73835457e+05,  1.89073885e+06,
        2.85680837e+05,  6.29631110e+05,  1.72841264e+05,  3.41607851e+05,
        3.18556516e+05,  2.03928263e+05,  3.14412979e+05,  4.00584760e+05,
        3.62669126e+05,  1.59096313e+05,  4.76939463e+05,  7.46634490e+04,
        2.69367400e+05,  1.89060532e+06,  9.05285877e+05,  3.27696917e+05,
        2.38797828e+05,  6.17375997e+05,  1.83606193e+06,  2.24898387e+05,
        5.82138488e+05,  5.48860578e+05,  4.45219268e+05,  1.73066405e+05,
        2.15860982e+05,  4.52835854e+05,  2.61090443e+05,  2.32125159e+05,
        1.54714623e+05,  5.54357694e+05,  5.51726260e+05,  4.40880647e+05,
        4.69222860e+05,  2.54339884e+05,  5.58045454e+04,  5.38936143e+05,
        2.86159088e+05,  3.14761234e+05,  1.63656541e+05,  2.92301517e+05,
        5.33093388e+05,  2.64041423e+05,  5.01835571e+05,  4.57415497e+05,
        2.64560272e+05])

In [39]:
r2_score(y_test,y_pred)

0.7063435855796965

### Our data is so small thats we are train and test the data 1000 times and choose the maximum one

In [43]:
scores = []
for i in range(1000):
    x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.2,random_state = i)
    lr = LinearRegression()
    pipe= make_pipeline(colum_tran,lr)
    pipe.fit(x_train,y_train)
    y_pred=pipe.predict(x_test)
    scores.append(r2_score(y_test,y_pred))

In [44]:
np.argmax(scores)

661

In [45]:
scores[np.argmax(scores)]

0.8897762920578806

In [48]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.2,random_state = np.argmax(scores))
lr = LinearRegression()
pipe= make_pipeline(colum_tran,lr)
pipe.fit(x_train,y_train)
y_pred=pipe.predict(x_test)
r2_score(y_test,y_pred)

0.8897762920578806

In [49]:
import pickle

In [50]:
pickle.dump(pipe,open('Linearregression.pkl','wb'))

In [ ]:
pipe.predict(pd.Dataframe([['Maruti  Suzuki Swift','Maruti',2019,100,'Petrol']],column = ['name','company','year','kms_']))